// Задача 7. За множеството от положителните цели числа, дефинираме
// следната итеративна редица: ако n е четно число, следващото число е n/2,
// ако n е нечетно число, следващото става 3*n+1
// Например, ако се започне с числото 13, ще се получи редицата
// 13, 40, 20, 10, 5, 16, 8, 4, 2, 1
// Редицата завършва, когато се получи 1.
// Напишете програма, която извежда от кое число, между 200 и 2000 трябва
// да се започне, че да се получи най-дълга редица.
// Да се изведе дължината на редицата и самата редица

#include <stdio.h>

int main(){

    int i, num, counter = 0, max = 0, n;

    for ( i = 200; i <= 2000; i++)
    {
        counter = 0;
        num = i;

        while( num != 1)
        {
            if (num % 2 == 0)
                num /= 2;
            else 
                num = 3 * num + 1;

            counter++;
        }

        if (counter > max)
        {
            max = counter;
            n = i;
        }
    }
    
    printf("%d", n);
}