// 15. (стек) Да се пресметне лицето на най-големия правоъгълник,
// който може де се вмести в криволинейна фигура. За целта фигурата
// се разделя с прави линии на N еднакви квадрати, като
// колоните се
// номерират с числата 1, 2, ..., N, от ляво на дясно.
// Правоъгълникът трябва да бъде съставен от цяло число
// такива квадрати. За всяка колона е намерен броят цели
// квадрати в нея.
// Напишете програма maxarrea, която да намери лицето на
// максимален правоъгълник, съставен от цели квадратчета, който може
// да се разположи вътре във фигурата.

#include "stack.h"

int main()
{
    size_t testArr[] = {2, 3, 2, 1, 1, 1, 1, 4, 3, 3, 2};
    size_t size = sizeof(testArr) / sizeof(size_t);

    size_t area = largestRectangleArea(testArr, size);

    printf("Largest rectangle area = %I64d", area);
    return 0;
}
