// Дадено е наредено тесте карти.
// Наредбата по тежест на карта е:
// 2,3,4,5,6,7,8,9,10, Вале, Дама, Поп, Асо.
// Наредбата по цвят на картите е:
// трефа, каро, купа, пика.
// Да се създаде програма на C, чрез която се въвежда N естествено число от интервала
// [1..51] и се извеждат въведения номер карта и останалите по-големи карти от тестето.
// Използвайте вложен цикъл.
// Пример:
// 47
// Изход:
// Поп купа, Поп пика, Асо трефа, Асо каро, Асо купа, Асо пика

#include <stdio.h>

int main(){
    int n;
    char cm, sp;
    do
    {
        printf("Enter number between 1 and 52: ");
        scanf("%d", &n);
    } while (n < 1 || n > 52);
    
    for (int i = n; i <= 52; i++)
    {
        printf("%c%c", cm, sp);
        sp = ' ';
        cm = ',';

        if (i <= 4)
            printf("Двойка ");   
        else if (i <= 8)
            printf("Тройка "); 
        else if (i <= 12)
            printf("Четворка ");
        else if (i <= 16)
            printf("Петица ");
        else if (i <= 20)
            printf("Шестица ");
        else if (i <= 24)
            printf("Седмица ");
        else if (i <= 28)
            printf("Осмица ");
        else if (i <= 32)
            printf("Девятка ");
        else if (i <= 36)
            printf("Десятка ");
        else if (i <= 40)
            printf("Вале ");
        else if (i <= 44)
            printf("Дама ");
        else if (i <= 48)
            printf("Поп ");
        else
            printf("Асо ");

        if (i == 1 || i == 5 || i == 9 || i == 13 || i == 17 || i == 21 || 
            i == 25 || i == 29 || i == 33 || i == 37 || i == 41 || i == 45 ||
            i == 49)
        {
            printf("трефа");
        }
        else if (i == 2 || i == 6 || i == 10 || i == 14 || i == 18 || i == 22 ||
                i == 26 || i == 30 || i == 34 || i == 38 || i == 42 || i == 46 ||
                i == 50 )
        {
            printf("каро");
        }
        else if (i == 3 || i == 7 || i == 11 || i == 15 || i == 19 || i == 23 ||
                i == 27 || i == 31 || i == 35 || i == 39 || i == 43 || i == 47 ||
                i == 51)
        {
            printf("купа");
        }
        else 
        {
            printf("пика");
        }     
    }
}